In [ ]:
import pandas as pd 
import matplotlib.pyplot as plt
import numpy as np
%matplotlib inline

In [ ]:
#loading datasets
riyadh_data=pd.read_csv('Riyadh_data.csv')
global_data=pd.read_csv('global.csv')

In [3]:
riyadh_data

check if local city is in city_list :

       city       country
267  Riyadh  Saudi Arabia

In [5]:
riyadh_data.fillna(method='ffill',inplace=True)

/Users/abdullahabu-sabba/opt/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:4244: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  **kwargs

In [6]:
local_data.isna().sum()

city        0
country     0
avg_temp    0
dtype: int64

            global_temp
year
1843-01-01         8.17
1844-01-01         7.65
1845-01-01         7.85
1846-01-01         8.55
1847-01-01         8.09

            Riyadh_temp
year
1843-01-01        24.74
1844-01-01        15.45
1845-01-01        20.82
1846-01-01        20.82
1847-01-01        20.82

In [9]:
riyadh_sma=riyadh_data[]

171

type : <class 'pandas.core.series.Series'>
length : 171

In [12]:
sma=mv(sma_7,7)

-- before Applying simple moveing average
type : <class 'pandas.core.series.Series'>
length : 171
-- after Applying simple moveing average and adding null window
type : <class 'list'>
length : 171

In [13]:
local_data.insert(1,'SMA_7',sma,True)

In [14]:
local_data.head(10)

            Riyadh_temp      SMA_7
year
1843-01-01        24.74  21.715714
1844-01-01        15.45  21.658571
1845-01-01        20.82  23.027143
1846-01-01        20.82  23.602857
1847-01-01        20.82  24.190000
1848-01-01        24.56  24.747143
1849-01-01        24.80  24.798571
1850-01-01        24.34  24.765714
1851-01-01        25.03  24.754286
1852-01-01        24.85  24.751429

In [15]:


 df.head

<bound method NDFrame.head of             Riyadh_temp
year
1843-01-01        24.74
1844-01-01        15.45
1845-01-01        20.82
1846-01-01        20.82
1847-01-01        20.82
...                 ...
2009-01-01        26.71
2010-01-01        27.37
2011-01-01        26.40
2012-01-01        26.83
2013-01-01        27.78

[171 rows x 1 columns]>

In [16]:
df.rolling(7).mean().head(10)

            Riyadh_temp
year
1843-01-01          NaN
1844-01-01          NaN
1845-01-01          NaN
1846-01-01          NaN
1847-01-01          NaN
1848-01-01          NaN
1849-01-01    21.715714
1850-01-01    21.658571
1851-01-01    23.027143
1852-01-01    23.602857

In [17]:
local_data.head(10)

            Riyadh_temp      SMA_7
year
1843-01-01        24.74  21.715714
1844-01-01        15.45  21.658571
1845-01-01        20.82  23.027143
1846-01-01        20.82  23.602857
1847-01-01        20.82  24.190000
1848-01-01        24.56  24.747143
1849-01-01        24.80  24.798571
1850-01-01        24.34  24.765714
1851-01-01        25.03  24.754286
1852-01-01        24.85  24.751429